# Pandas-DataFrames

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

Now we are going to set a seed. Seed will insure that every one will get same random number. Everyone means whose tutorial i am following.

In [3]:
np.random.seed(101)

In [7]:
# Create Some Data For DataFrame. This is 5 by 4 Matrix
data = randn(5,4)
# Create Row Label using python list
rowLabel = ['Row-0','Row-1','Row-2','Row-3','Row-4']
# Create Column Label using python list
columnLabel = ['Column-0','Column-1','Column-2','Column-3']

In [8]:
# Create a pandas DataFrame
dataFrame = pd.DataFrame(data=data,index=rowLabel,columns=columnLabel)

In [9]:
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  0.302665  1.693723 -1.706086 -1.159119
Row-1 -0.134841  0.390528  0.166905  0.184502
Row-2  0.807706  0.072960  0.638787  0.329646
Row-3 -0.497104 -0.754070 -0.943406  0.484752
Row-4 -0.116773  1.901755  0.238127  1.996652

Each of those pandas column is actually pandas series. Column-0 is a pandas series as well as rest of the column also pandas series. All the column in pandas column share common index / row number. Example: All the column has Row-2 in it.

# Select Column

In [11]:
# Lets grab Column-2 from the dataFrame
dataFrame['Column-2']
# Now see Column-2 looks like pandas series.

Row-0   -1.706086
Row-1    0.166905
Row-2    0.638787
Row-3   -0.943406
Row-4    0.238127
Name: Column-2, dtype: float64

In [12]:
# You can confirm that column of DataFrame are pandas series by passing Column-2 to
# type() function.
type(dataFrame['Column-2'])
# That means a DataFrame is bunch of series that share a same index.

pandas.core.series.Series

In [13]:
# See type of dataFrame
type(dataFrame)

pandas.core.frame.DataFrame

In [16]:
# If we want multiple column from dataFrame, we will pass python list of column
toBeRetrivedListOfColumn = ['Column-1','Column-3']
dataFrame[toBeRetrivedListOfColumn]

       Column-1  Column-3
Row-0  1.693723 -1.159119
Row-1  0.390528  0.184502
Row-2  0.072960  0.329646
Row-3 -0.754070  0.484752
Row-4  1.901755  1.996652

# Create New Column

In [17]:
# See the already listed column
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  0.302665  1.693723 -1.706086 -1.159119
Row-1 -0.134841  0.390528  0.166905  0.184502
Row-2  0.807706  0.072960  0.638787  0.329646
Row-3 -0.497104 -0.754070 -0.943406  0.484752
Row-4 -0.116773  1.901755  0.238127  1.996652

Now we will add a new column to the right. This new column will be the summation of all the column in same idex / row. Example: First Row Of New Column will be sum of all the Row-0.

In [22]:
dataFrame['sum'] = dataFrame['Column-0'] + dataFrame['Column-1'] + dataFrame['Column-2'] + dataFrame['Column-3']

In [23]:
# Now see, whether sum column is added or not.
dataFrame

       Column-0  Column-1  Column-2  Column-3       sum
Row-0  0.302665  1.693723 -1.706086 -1.159119 -0.868817
Row-1 -0.134841  0.390528  0.166905  0.184502  0.607094
Row-2  0.807706  0.072960  0.638787  0.329646  1.849099
Row-3 -0.497104 -0.754070 -0.943406  0.484752 -1.709828
Row-4 -0.116773  1.901755  0.238127  1.996652  4.019761

# Remove Column

To remove a column from DataFrame, Type dataFrame.drop('sum',axis=1). Why did we write axis=1? if we don't write axis=1, then it will look on rows. As default is axix=0, which is row.

In [24]:
dataFrame.drop('sum',axis=1)

       Column-0  Column-1  Column-2  Column-3
Row-0  0.302665  1.693723 -1.706086 -1.159119
Row-1 -0.134841  0.390528  0.166905  0.184502
Row-2  0.807706  0.072960  0.638787  0.329646
Row-3 -0.497104 -0.754070 -0.943406  0.484752
Row-4 -0.116773  1.901755  0.238127  1.996652

In [25]:
# Interesting thing happen when we try to see the table inside dataFrame
dataFrame

       Column-0  Column-1  Column-2  Column-3       sum
Row-0  0.302665  1.693723 -1.706086 -1.159119 -0.868817
Row-1 -0.134841  0.390528  0.166905  0.184502  0.607094
Row-2  0.807706  0.072960  0.638787  0.329646  1.849099
Row-3 -0.497104 -0.754070 -0.943406  0.484752 -1.709828
Row-4 -0.116773  1.901755  0.238127  1.996652  4.019761

We have dropped 'sum' column. How did this column still in the dataFrame? Pandas default inplace=False, that means pandas will not delete any column or row unless we wspecifically say it to do that, by passing inplace=True

In [26]:
# Now we will permanently remove 'sum' column from dataFrame
dataFrame.drop('sum',axis=1,inplace=True)

In [28]:
# Now check again
dataFrame
# See 'sum' column has been removed from dataFrame permanently.

       Column-0  Column-1  Column-2  Column-3
Row-0  0.302665  1.693723 -1.706086 -1.159119
Row-1 -0.134841  0.390528  0.166905  0.184502
Row-2  0.807706  0.072960  0.638787  0.329646
Row-3 -0.497104 -0.754070 -0.943406  0.484752
Row-4 -0.116773  1.901755  0.238127  1.996652

# Remove Rows

Removing row is same as removing column.Only we will either select axis=0 or don't pass any value for
axis (because default value is zero)

In [29]:
dataFrame.drop('Row-4',axis=0)

       Column-0  Column-1  Column-2  Column-3
Row-0  0.302665  1.693723 -1.706086 -1.159119
Row-1 -0.134841  0.390528  0.166905  0.184502
Row-2  0.807706  0.072960  0.638787  0.329646
Row-3 -0.497104 -0.754070 -0.943406  0.484752

In [30]:
# Same problem like removing column. We have explicitly write inplace=true
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  0.302665  1.693723 -1.706086 -1.159119
Row-1 -0.134841  0.390528  0.166905  0.184502
Row-2  0.807706  0.072960  0.638787  0.329646
Row-3 -0.497104 -0.754070 -0.943406  0.484752
Row-4 -0.116773  1.901755  0.238127  1.996652

In [34]:
# As axis=0 is default, so we did not pass any value for axix
dataFrame.drop('Row-4',inplace=True)

In [35]:
# See Row-4 has been permanently deleted.
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  0.302665  1.693723 -1.706086 -1.159119
Row-1 -0.134841  0.390528  0.166905  0.184502
Row-2  0.807706  0.072960  0.638787  0.329646
Row-3 -0.497104 -0.754070 -0.943406  0.484752

# Select Rows

In [36]:
# See the dataFrame
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  0.302665  1.693723 -1.706086 -1.159119
Row-1 -0.134841  0.390528  0.166905  0.184502
Row-2  0.807706  0.072960  0.638787  0.329646
Row-3 -0.497104 -0.754070 -0.943406  0.484752

There is a two ways to select rows in DataFrame. Means there is two method to use.
<ol>
    <li>loc[ 'Row-1' ]:</li>
    <li></li>
</ol>